; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	infrared0 - mode
	image2 - mode
	thermograph1 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument3 infrared0)
	(supports instrument3 image2)
	(calibration_target instrument3 Star4)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument5 thermograph1)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star4)
	(supports instrument6 image2)
	(supports instrument6 thermograph1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(have_image Planet5 thermograph1)
	(have_image Planet6 image2)
	(have_image Phenomenon7 thermograph1)
	(have_image Star8 infrared0)
	(have_image Star9 image2)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 thermograph1)
	(have_image Planet12 image2)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 image2)
	(have_image Planet15 infrared0)
	(have_image Star16 infrared0)
	(have_image Phenomenon17 thermograph1)
))

)

; plan
1. (turn_to satellite2 star4 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star4)
   goals met: 1 of 14
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 14
3. (calibrate satellite2 instrument5 star4)
   added: (calibrated instrument5)
   goals met: 1 of 14
4. (turn_to satellite2 phenomenon7 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon7)
   goals met: 1 of 14
5. (take_image satellite2 phenomenon7 instrument5 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 2 of 14
6. (turn_to satellite2 phenomenon17 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon17)
   goals met: 2 of 14
7. (take_image satellite2 phenomenon17 instrument5 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 3 of 14
8. (turn_to satellite2 phenomenon14 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon14)
   goals met: 3 of 14
9. (take_image satellite2 phenomenon14 instrument5 image2)
   added: (have_image phenomenon14 image2)
   goals met: 4 of 14
10. (turn_to satellite2 phenomenon13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon13)
   goals met: 4 of 14
11. (take_image satellite2 phenomenon13 instrument5 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 5 of 14
12. (turn_to satellite2 phenomenon10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon10)
   goals met: 5 of 14
13. (take_image satellite2 phenomenon10 instrument5 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 6 of 14
14. (turn_to satellite2 planet12 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet12)
   goals met: 6 of 14
15. (take_image satellite2 planet12 instrument5 image2)
   added: (have_image planet12 image2)
   goals met: 7 of 14
16. (turn_to satellite2 planet15 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet15)
   goals met: 7 of 14
17. (take_image satellite2 planet15 instrument5 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 8 of 14
18. (turn_to satellite2 planet5 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet5)
   goals met: 8 of 14
19. (take_image satellite2 planet5 instrument5 thermograph1)
   added: (have_image planet5 thermograph1)
   goals met: 9 of 14
20. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   goals met: 9 of 14
21. (take_image satellite2 planet6 instrument5 image2)
   added: (have_image planet6 image2)
   goals met: 10 of 14
22. (turn_to satellite2 star11 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star11)
   goals met: 10 of 14
23. (take_image satellite2 star11 instrument5 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 11 of 14
24. (turn_to satellite2 star16 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star16)
   goals met: 11 of 14
25. (take_image satellite2 star16 instrument5 infrared0)
   added: (have_image star16 infrared0)
   goals met: 12 of 14
26. (turn_to satellite2 star8 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star8)
   goals met: 12 of 14
27. (take_image satellite2 star8 instrument5 infrared0)
   added: (have_image star8 infrared0)
   goals met: 13 of 14
28. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 13 of 14
29. (take_image satellite2 star9 instrument5 image2)
   added: (have_image star9 image2)
   goals met: 14 of 14
